In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("titanic_train.csv")

In [3]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
df.shape

(891, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.describe() # stat summary

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df['Sex'].describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

In [8]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [9]:
df['Embarked'].nunique()

3

In [10]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
df_2 = pd.read_csv('gun-violence-data1.csv')

In [12]:
df_2.head()

,incident_id,date,state,city_or_county,address,n_killed,n_injured
0,461105,01-01-2013,Pennsylvania,Mckeesport,1506 Versailles Avenue and Coursin Street,0,4
1,460726,01-01-2013,California,Hawthorne,13500 block of Cerise Avenue,1,3
2,478855,01-01-2013,Ohio,Lorain,1776 East 28th Street,1,3
3,478925,05-01-2013,Colorado,Aurora,16000 block of East Ithaca Place,4,0
4,478959,07-01-2013,North Carolina,Greensboro,307 Mourning Dove Terrace,2,2

In [13]:
df_2.shape

(239677, 7)

In [15]:
from datetime import datetime

#df_2['date'] = pd.to_datetime(df_2['date'])
df_2['date'] = pd.to_datetime(df_2['date'],dayfirst = True)

df_2['day'] = df_2['date'].dt.day
df_2['month'] = df_2['date'].dt.month
df_2['year'] = df_2['date'].dt.year
df_2['day_of_week'] =df_2['date'].dt.dayofweek

df_2['tot_victim'] = df_2['n_killed']+df_2['n_injured']

In [16]:
df_2.head()

,incident_id,date,state,city_or_county,address,n_killed,n_injured,day,month,year,day_of_week,tot_victim
0,461105,2013-01-01,Pennsylvania,Mckeesport,1506 Versailles Avenue and Coursin Street,0,4,1,1,2013,1,4
1,460726,2013-01-01,California,Hawthorne,13500 block of Cerise Avenue,1,3,1,1,2013,1,4
2,478855,2013-01-01,Ohio,Lorain,1776 East 28th Street,1,3,1,1,2013,1,4
3,478925,2013-01-05,Colorado,Aurora,16000 block of East Ithaca Place,4,0,5,1,2013,5,4
4,478959,2013-01-07,North Carolina,Greensboro,307 Mourning Dove Terrace,2,2,7,1,2013,0,4

In [17]:
df_2['day_of_week']  = df_2['day_of_week'].map({0:"monday",1:"tue",2:"wed",3:'thur',4:"fri",5:"sat",6:"Sunday"})

In [18]:
df_2.head()

,incident_id,date,state,city_or_county,address,n_killed,n_injured,day,month,year,day_of_week,tot_victim
0,461105,2013-01-01,Pennsylvania,Mckeesport,1506 Versailles Avenue and Coursin Street,0,4,1,1,2013,tue,4
1,460726,2013-01-01,California,Hawthorne,13500 block of Cerise Avenue,1,3,1,1,2013,tue,4
2,478855,2013-01-01,Ohio,Lorain,1776 East 28th Street,1,3,1,1,2013,tue,4
3,478925,2013-01-05,Colorado,Aurora,16000 block of East Ithaca Place,4,0,5,1,2013,sat,4
4,478959,2013-01-07,North Carolina,Greensboro,307 Mourning Dove Terrace,2,2,7,1,2013,monday,4

In [19]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239677 entries, 0 to 239676
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   incident_id     239677 non-null  int64
 1   date            239677 non-null  datetime64[ns]
 2   state           239677 non-null  object
 3   city_or_county  239677 non-null  object
 4   address         223180 non-null  object
 5   n_killed        239677 non-null  int64
 6   n_injured       239677 non-null  int64
 7   day             239677 non-null  int32
 8   month           239677 non-null  int32
 9   year            239677 non-null  int32
 10  day_of_week     239677 non-null  object
 11  tot_victim      239677 non-null  int64
dtypes: datetime64[ns](1), int32(3), int64(4), object(4)
memory usage: 19.2+ MB

In [20]:
df_2['day_of_week'].value_counts()

day_of_week
Sunday    37052
sat       36096
wed       34126
monday    33760
tue       33307
fri       32775
thur      32561
Name: count, dtype: int64

In [22]:
# groupby
df_2.groupby('day_of_week')['tot_victim'].count()

day_of_week
Sunday    37052
fri       32775
monday    33760
sat       36096
thur      32561
tue       33307
wed       34126
Name: tot_victim, dtype: int64

In [23]:
df_2.groupby('state')['tot_victim'].sum()

state
Alabama                  4878
Alaska                    592
Arizona                  2190
Arkansas                 2120
California              13206
Colorado                 1929
Connecticut              1599
Delaware                 1070
District of Columbia     1874
Florida                 10981
Georgia                  6512
Hawaii                    148
Idaho                     315
Illinois                16923
Indiana                  4564
Iowa                     1094
Kansas                   1473
Kentucky                 2960
Louisiana                6577
Maine                     244
Maryland                 4858
Massachusetts            2173
Michigan                 4578
Minnesota                1377
Mississippi              3059
Missouri                 5721
Montana                   290
Nebraska                  899
Nevada                   1750
New Hampshire             232
New Jersey               3708
New Mexico               1038
New York                 6764
North Carolina           6854
North Dakota              199
Ohio                     8211
Oklahoma                 2491
Oregon                   1140
Pennsylvania             7451
Rhode Island              409
South Carolina           4694
South Dakota              204
Tennessee                6302
Texas                   11152
Utah                      684
Vermont                   130
Virginia                 5025
Washington               2140
West Virginia             984
Wisconsin                2979
Wyoming                   125
Name: tot_victim, dtype: int64

In [24]:
df_2.groupby('state')['tot_victim'].sum().sort_values(ascending = True)

state
Wyoming                   125
Vermont                   130
Hawaii                    148
North Dakota              199
South Dakota              204
New Hampshire             232
Maine                     244
Montana                   290
Idaho                     315
Rhode Island              409
Alaska                    592
Utah                      684
Nebraska                  899
West Virginia             984
New Mexico               1038
Delaware                 1070
Iowa                     1094
Oregon                   1140
Minnesota                1377
Kansas                   1473
Connecticut              1599
Nevada                   1750
District of Columbia     1874
Colorado                 1929
Arkansas                 2120
Washington               2140
Massachusetts            2173
Arizona                  2190
Oklahoma                 2491
Kentucky                 2960
Wisconsin                2979
Mississippi              3059
New Jersey               3708
Indiana                  4564
Michigan                 4578
South Carolina           4694
Maryland                 4858
Alabama                  4878
Virginia                 5025
Missouri                 5721
Tennessee                6302
Georgia                  6512
Louisiana                6577
New York                 6764
North Carolina           6854
Pennsylvania             7451
Ohio                     8211
Florida                 10981
Texas                   11152
California              13206
Illinois                16923
Name: tot_victim, dtype: int64

In [25]:
df_2.groupby('month')['tot_victim'].count().sort_values(ascending = False)

month
1     23091
3     22640
7     21126
8     21040
5     19930
10    19890
9     19656
2     18841
6     18755
4     18628
12    18106
11    17974
Name: tot_victim, dtype: int64

In [26]:
# combining 2 dataframe

df1 = pd.DataFrame({"name":["Ajantha","devi"],"age":[60,70]})
df2 = pd.DataFrame({"name":["steve","jobs"],"age":[56,67]})

In [27]:
df1

      name  age
0  Ajantha   60
1     devi   70

In [28]:
df2

    name  age
0  steve   56
1   jobs   67

In [29]:
# concat
pd.concat([df1,df2],axis = 1)

      name  age   name  age
0  Ajantha   60  steve   56
1     devi   70   jobs   67

In [30]:
df3 = pd.concat([df1,df2],axis = 0)
df3

      name  age
0  Ajantha   60
1     devi   70
0    steve   56
1     jobs   67

In [31]:
df4 = pd.DataFrame({"name":["vicky","micky"],"age":[67,78],"hobby":["swimming","reading"]})
df4

    name  age     hobby
0  vicky   67  swimming
1  micky   78   reading

In [33]:
pd.concat([df3,df4],join = 'outer', ignore_index=True)

      name  age     hobby
0  Ajantha   60       NaN
1     devi   70       NaN
2    steve   56       NaN
3     jobs   67       NaN
4    vicky   67  swimming
5    micky   78   reading

In [34]:
pd.concat([df3,df4],join = 'inner', ignore_index=True)

      name  age
0  Ajantha   60
1     devi   70
2    steve   56
3     jobs   67
4    vicky   67
5    micky   78

In [35]:
# merge
size = pd.DataFrame({"colour":['red','blue','yellow'],"size":['S','M',"L"]})
gender = pd.DataFrame({"colour":['red','green','yellow'],"gender":['F','M',"F"]})

In [36]:
size

   colour size
0     red    S
1    blue    M
2  yellow    L

In [37]:
gender

   colour gender
0     red      F
1   green      M
2  yellow      F

In [38]:
pd.merge(size,gender,how = 'outer')

   colour size gender
0    blue    M    NaN
1   green  NaN      M
2     red    S      F
3  yellow    L      F

In [39]:
pd.merge(size,gender,how = 'inner')

   colour size gender
0     red    S      F
1  yellow    L      F

In [40]:
pd.merge(size,gender,how = 'left')

   colour size gender
0     red    S      F
1    blue    M    NaN
2  yellow    L      F

In [41]:
pd.merge(size,gender,how = 'right')

   colour size gender
0     red    S      F
1   green  NaN      M
2  yellow    L      F